# დრო დავაიმპორტირეთ
import time

t = int(input("Enter the time in seconds: "))

#შევქმენით ფინქცია
def countdown(t):
    while t:#შევქმენით ციკლი მანამ, სანამ t არის  0 (ანუ ჯერ კიდევ დარჩენილია დრო)
        mins, secs = divmod(t, 60) #ყოფს დროს წამებად და წუთებად
        timer = '{:02d}:{:02d}'.format(mins, secs)#დროის ფორმატირება,02d ნიშნავს ორნიშნა რიცხვი, საჭიროების შემთხვევაში ნულით შევსებული.
        print(timer, end='\r')# ბეჭდავს ტაიმერს ერთსა და იმავე ხაზზე.
        time.sleep(1)#პროგრამა აჩერებს შესრულებას 1 წამით.
        t -= 1 #დრო მცირდება 1 წამით.

    print("Time's Up")




countdown(t)
